## Assignment 1 - Pandas Basics

Before you start this assignment, please review the class notebook for 1 - Pandas.

#### Q1

1. Read "airbnb_ny_2019_500.csv" into a `DataFrame` object. 
2. Print the first five rows for preview.

To access the CSV file, use this path: "https://www.dropbox.com/s/8k1fmzcmq3lf5xo/airbnb_ny_2019_500.csv?dl=1"

**Desired output:**

<img src="https://github.com/xgao-fin/buan402/raw/gh-pages/Assignments/Assignment_1/buan402_a1_q3_output.png" width="800">

In [7]:
# importing necessery libraries
import pandas as pd

# using 'pd.read_csv()' function to load the dataset
df = pd.read_csv("https://www.dropbox.com/s/8k1fmzcmq3lf5xo/airbnb_ny_2019_500.csv?dl=1")

# print head (first five rows) of the dataset
df.head()

,list_id,host_id,host_name,neighborhood,room_type,price,min_nights,num_reviews,reviews_per_mon,last_review
0,1,2787,John,Brooklyn,Private room,149,1,9.0,0.21,10/19/2018
1,2,2845,Jennifer,Manhattan,Entire home,225,1,45.0,0.38,5/21/2019
2,3,4632,Elisabeth,Manhattan,Private room,150,3,NaN,NaN,NaN
3,4,4869,LisaRoxanne,Brooklyn,Entire home,89,1,270.0,4.64,7/5/2019
4,5,7192,Laura,Manhattan,Entire home,80,10,9.0,0.10,11/19/2018

---

#### Q2

Count and print the total number of listings (rows) in the dataset.

Hint:
`len()`

**Desired output:**

```500```

In [8]:
# count total listings:
count_row = len(df)

# print the count:
print(count_row)

500

---

#### Q3

1. Generate a new variable, `num_years`, defined as the number of years each listing has been listed on Airbnb. 
2. Print the first five listings in the resulting dataframe. Round the results to two decimals. 

Hint:
- `num_years` can be computed from `num_reviews` and `reviews_per_mon`.

**Desired output:**

<img src="https://github.com/xgao-fin/buan402/raw/gh-pages/Assignments/Assignment_1/buan402_a1_q3_output.png" width="800">
<img src="C:\Users\xin_g\Dropbox\My Teaching\Shared_Folders\BUAN402_Python_for_Finance\assignments\Assignment_1" width="800">

In [9]:
# calculate the number of months for each listing
df['num_years'] = df['num_reviews'] / df['reviews_per_mon']

# calculate months into years and round the result to two decimals
df['num_years'] = round(df['num_years']/12,2)

# print the first five listings
df.head()

,list_id,host_id,host_name,neighborhood,room_type,price,min_nights,num_reviews,reviews_per_mon,last_review,num_years
0,1,2787,John,Brooklyn,Private room,149,1,9.0,0.21,10/19/2018,3.57
1,2,2845,Jennifer,Manhattan,Entire home,225,1,45.0,0.38,5/21/2019,9.87
2,3,4632,Elisabeth,Manhattan,Private room,150,3,NaN,NaN,NaN,NaN
3,4,4869,LisaRoxanne,Brooklyn,Entire home,89,1,270.0,4.64,7/5/2019,4.85
4,5,7192,Laura,Manhattan,Entire home,80,10,9.0,0.10,11/19/2018,7.50

---

#### Q4

1. Sort all listings by `price`, from the lowest to highest.
2. Print the five listings with lowest prices.

Hint:
- Review `.sort_values()'.

**Desired output:**

<img src="https://www.dropbox.com/s/uczmrhpgbfm7k30/Q4_1_Output.PNG?dl=1" width="800">

In [10]:
# generate a new dataframe sorted by "price"
df1 = df.sort_values(by='price')

# print the five lowest-priced listings
df1.head()

,list_id,host_id,host_name,neighborhood,room_type,price,min_nights,num_reviews,reviews_per_mon,last_review,num_years
469,470,733894,Lucy,Queens,Private room,33,44,31.0,0.32,5/1/2019,8.07
36,37,7355,Vt,Brooklyn,Private room,35,60,NaN,NaN,NaN,NaN
249,250,303939,Lissette,Staten Island,Private room,36,2,193.0,1.85,6/25/2019,8.69
256,257,303939,Lissette,Staten Island,Private room,36,2,333.0,3.19,7/2/2019,8.70
484,485,806214,Vanessa,Bronx,Private room,37,4,117.0,1.21,5/21/2019,8.06